; domain
(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates 
  		   (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
		   (handempty)
	       (holding ?x)
	)

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)
		 )
	)

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)
		 )
	)

  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)
		 )
	)

  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))
		 )
	)
)

; problem
(define (problem BLOCKS-17-0)
(:domain BLOCKS)
(:objects C D E F B I J A N O K M P H G L Q )
(:INIT (CLEAR Q) (CLEAR L) (CLEAR G) (CLEAR H) (CLEAR P) (ONTABLE M)
 (ONTABLE K) (ONTABLE O) (ONTABLE N) (ONTABLE P) (ON Q A) (ON A J) (ON J I)
 (ON I B) (ON B M) (ON L F) (ON F E) (ON E K) (ON G D) (ON D C) (ON C O)
 (ON H N) (HANDEMPTY))
 
(:goal (AND (ON Q N) (ON N L) (ON L O) (ON O J) (ON J H) (ON H C) (ON C E)
            (ON E M) (ON M P) (ON P A) (ON A G) (ON G B) (ON B I) (ON I K)
            (ON K F) (ON F D)))
)

; plan
1. (unstack g d)
   deleted: (clear g) (handempty) (on g d)
   added: (holding g) (clear d)
   goals met: 0 of 16
2. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 0 of 16
3. (unstack d c)
   deleted: (clear d) (handempty) (on d c)
   added: (holding d) (clear c)
   goals met: 0 of 16
4. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 0 of 16
5. (unstack h n)
   deleted: (clear h) (handempty) (on h n)
   added: (holding h) (clear n)
   goals met: 0 of 16
6. (stack h c)
   deleted: (holding h) (clear c)
   added: (clear h) (handempty) (on h c)
   goals met: 1 of 16
7. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 1 of 16
8. (stack n l)
   deleted: (holding n) (clear l)
   added: (clear n) (handempty) (on n l)
   goals met: 2 of 16
9. (unstack q a)
   deleted: (clear q) (handempty) (on q a)
   added: (holding q) (clear a)
   goals met: 2 of 16
10. (stack q n)
   deleted: (holding q) (clear n)
   added: (clear q) (handempty) (on q n)
   goals met: 3 of 16
11. (unstack a j)
   deleted: (clear a) (handempty) (on a j)
   added: (holding a) (clear j)
   goals met: 3 of 16
12. (stack a g)
   deleted: (holding a) (clear g)
   added: (clear a) (handempty) (on a g)
   goals met: 4 of 16
13. (unstack j i)
   deleted: (clear j) (handempty) (on j i)
   added: (holding j) (clear i)
   goals met: 4 of 16
14. (stack j h)
   deleted: (holding j) (clear h)
   added: (clear j) (handempty) (on j h)
   goals met: 5 of 16
15. (pick-up p)
   deleted: (ontable p) (clear p) (handempty)
   added: (holding p)
   goals met: 5 of 16
16. (stack p a)
   deleted: (holding p) (clear a)
   added: (clear p) (handempty) (on p a)
   goals met: 6 of 16
17. (unstack i b)
   deleted: (clear i) (handempty) (on i b)
   added: (holding i) (clear b)
   goals met: 6 of 16
18. (put-down i)
   deleted: (holding i)
   added: (clear i) (handempty) (ontable i)
   goals met: 6 of 16
19. (unstack b m)
   deleted: (clear b) (handempty) (on b m)
   added: (holding b) (clear m)
   goals met: 6 of 16
20. (stack b i)
   deleted: (holding b) (clear i)
   added: (clear b) (handempty) (on b i)
   goals met: 7 of 16
21. (pick-up m)
   deleted: (ontable m) (clear m) (handempty)
   added: (holding m)
   goals met: 7 of 16
22. (stack m p)
   deleted: (holding m) (clear p)
   added: (clear m) (handempty) (on m p)
   goals met: 8 of 16
23. (unstack q n)
   deleted: (clear q) (handempty) (on q n)
   added: (holding q) (clear n)
   goals met: 7 of 16
24. (put-down q)
   deleted: (holding q)
   added: (clear q) (handempty) (ontable q)
   goals met: 7 of 16
25. (unstack n l)
   deleted: (clear n) (handempty) (on n l)
   added: (holding n) (clear l)
   goals met: 6 of 16
26. (put-down n)
   deleted: (holding n)
   added: (clear n) (handempty) (ontable n)
   goals met: 6 of 16
27. (pick-up q)
   deleted: (ontable q) (clear q) (handempty)
   added: (holding q)
   goals met: 6 of 16
28. (stack q n)
   deleted: (holding q) (clear n)
   added: (clear q) (handempty) (on q n)
   goals met: 7 of 16
29. (unstack l f)
   deleted: (clear l) (handempty) (on l f)
   added: (holding l) (clear f)
   goals met: 7 of 16
30. (put-down l)
   deleted: (holding l)
   added: (clear l) (handempty) (ontable l)
   goals met: 7 of 16
31. (unstack f e)
   deleted: (clear f) (handempty) (on f e)
   added: (holding f) (clear e)
   goals met: 7 of 16
32. (stack f d)
   deleted: (holding f) (clear d)
   added: (clear f) (handempty) (on f d)
   goals met: 8 of 16
33. (unstack e k)
   deleted: (clear e) (handempty) (on e k)
   added: (holding e) (clear k)
   goals met: 8 of 16
34. (stack e m)
   deleted: (holding e) (clear m)
   added: (clear e) (handempty) (on e m)
   goals met: 9 of 16
35. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 9 of 16
36. (stack k f)
   deleted: (holding k) (clear f)
   added: (clear k) (handempty) (on k f)
   goals met: 10 of 16
37. (unstack b i)
   deleted: (clear b) (handempty) (on b i)
   added: (holding b) (clear i)
   goals met: 9 of 16
38. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 9 of 16
39. (pick-up i)
   deleted: (ontable i) (clear i) (handempty)
   added: (holding i)
   goals met: 9 of 16
40. (stack i k)
   deleted: (holding i) (clear k)
   added: (clear i) (handempty) (on i k)
   goals met: 10 of 16
41. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 10 of 16
42. (stack b i)
   deleted: (holding b) (clear i)
   added: (clear b) (handempty) (on b i)
   goals met: 11 of 16
43. (unstack q n)
   deleted: (clear q) (handempty) (on q n)
   added: (holding q) (clear n)
   goals met: 10 of 16
44. (put-down q)
   deleted: (holding q)
   added: (clear q) (handempty) (ontable q)
   goals met: 10 of 16
45. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 10 of 16
46. (stack n l)
   deleted: (holding n) (clear l)
   added: (clear n) (handempty) (on n l)
   goals met: 11 of 16
47. (pick-up q)
   deleted: (ontable q) (clear q) (handempty)
   added: (holding q)
   goals met: 11 of 16
48. (stack q n)
   deleted: (holding q) (clear n)
   added: (clear q) (handempty) (on q n)
   goals met: 12 of 16
49. (unstack j h)
   deleted: (clear j) (handempty) (on j h)
   added: (holding j) (clear h)
   goals met: 11 of 16
50. (put-down j)
   deleted: (holding j)
   added: (clear j) (handempty) (ontable j)
   goals met: 11 of 16
51. (unstack h c)
   deleted: (clear h) (handempty) (on h c)
   added: (holding h) (clear c)
   goals met: 10 of 16
52. (put-down h)
   deleted: (holding h)
   added: (clear h) (handempty) (ontable h)
   goals met: 10 of 16
53. (unstack c o)
   deleted: (clear c) (handempty) (on c o)
   added: (holding c) (clear o)
   goals met: 10 of 16
54. (stack c e)
   deleted: (holding c) (clear e)
   added: (clear c) (handempty) (on c e)
   goals met: 11 of 16
55. (pick-up j)
   deleted: (ontable j) (clear j) (handempty)
   added: (holding j)
   goals met: 11 of 16
56. (stack j h)
   deleted: (holding j) (clear h)
   added: (clear j) (handempty) (on j h)
   goals met: 12 of 16
57. (pick-up o)
   deleted: (ontable o) (clear o) (handempty)
   added: (holding o)
   goals met: 12 of 16
58. (stack o j)
   deleted: (holding o) (clear j)
   added: (clear o) (handempty) (on o j)
   goals met: 13 of 16
59. (unstack q n)
   deleted: (clear q) (handempty) (on q n)
   added: (holding q) (clear n)
   goals met: 12 of 16
60. (put-down q)
   deleted: (holding q)
   added: (clear q) (handempty) (ontable q)
   goals met: 12 of 16
61. (unstack n l)
   deleted: (clear n) (handempty) (on n l)
   added: (holding n) (clear l)
   goals met: 11 of 16
62. (put-down n)
   deleted: (holding n)
   added: (clear n) (handempty) (ontable n)
   goals met: 11 of 16
63. (pick-up q)
   deleted: (ontable q) (clear q) (handempty)
   added: (holding q)
   goals met: 11 of 16
64. (stack q n)
   deleted: (holding q) (clear n)
   added: (clear q) (handempty) (on q n)
   goals met: 12 of 16
65. (pick-up l)
   deleted: (ontable l) (clear l) (handempty)
   added: (holding l)
   goals met: 12 of 16
66. (stack l o)
   deleted: (holding l) (clear o)
   added: (clear l) (handempty) (on l o)
   goals met: 13 of 16
67. (unstack q n)
   deleted: (clear q) (handempty) (on q n)
   added: (holding q) (clear n)
   goals met: 12 of 16
68. (put-down q)
   deleted: (holding q)
   added: (clear q) (handempty) (ontable q)
   goals met: 12 of 16
69. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 12 of 16
70. (stack n l)
   deleted: (holding n) (clear l)
   added: (clear n) (handempty) (on n l)
   goals met: 13 of 16
71. (pick-up q)
   deleted: (ontable q) (clear q) (handempty)
   added: (holding q)
   goals met: 13 of 16
72. (stack q n)
   deleted: (holding q) (clear n)
   added: (clear q) (handempty) (on q n)
   goals met: 14 of 16
73. (unstack c e)
   deleted: (clear c) (handempty) (on c e)
   added: (holding c) (clear e)
   goals met: 13 of 16
74. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 13 of 16
75. (unstack e m)
   deleted: (clear e) (handempty) (on e m)
   added: (holding e) (clear m)
   goals met: 12 of 16
76. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 12 of 16
77. (unstack m p)
   deleted: (clear m) (handempty) (on m p)
   added: (holding m) (clear p)
   goals met: 11 of 16
78. (put-down m)
   deleted: (holding m)
   added: (clear m) (handempty) (ontable m)
   goals met: 11 of 16
79. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 11 of 16
80. (stack e m)
   deleted: (holding e) (clear m)
   added: (clear e) (handempty) (on e m)
   goals met: 12 of 16
81. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 12 of 16
82. (stack c e)
   deleted: (holding c) (clear e)
   added: (clear c) (handempty) (on c e)
   goals met: 13 of 16
83. (unstack p a)
   deleted: (clear p) (handempty) (on p a)
   added: (holding p) (clear a)
   goals met: 12 of 16
84. (put-down p)
   deleted: (holding p)
   added: (clear p) (handempty) (ontable p)
   goals met: 12 of 16
85. (unstack a g)
   deleted: (clear a) (handempty) (on a g)
   added: (holding a) (clear g)
   goals met: 11 of 16
86. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 11 of 16
87. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 11 of 16
88. (stack g b)
   deleted: (holding g) (clear b)
   added: (clear g) (handempty) (on g b)
   goals met: 12 of 16
89. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 12 of 16
90. (stack a g)
   deleted: (holding a) (clear g)
   added: (clear a) (handempty) (on a g)
   goals met: 13 of 16
91. (pick-up p)
   deleted: (ontable p) (clear p) (handempty)
   added: (holding p)
   goals met: 13 of 16
92. (stack p a)
   deleted: (holding p) (clear a)
   added: (clear p) (handempty) (on p a)
   goals met: 14 of 16
93. (unstack c e)
   deleted: (clear c) (handempty) (on c e)
   added: (holding c) (clear e)
   goals met: 13 of 16
94. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 13 of 16
95. (unstack e m)
   deleted: (clear e) (handempty) (on e m)
   added: (holding e) (clear m)
   goals met: 12 of 16
96. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 12 of 16
97. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 12 of 16
98. (stack c e)
   deleted: (holding c) (clear e)
   added: (clear c) (handempty) (on c e)
   goals met: 13 of 16
99. (pick-up m)
   deleted: (ontable m) (clear m) (handempty)
   added: (holding m)
   goals met: 13 of 16
100. (stack m p)
   deleted: (holding m) (clear p)
   added: (clear m) (handempty) (on m p)
   goals met: 14 of 16
101. (unstack c e)
   deleted: (clear c) (handempty) (on c e)
   added: (holding c) (clear e)
   goals met: 13 of 16
102. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 13 of 16
103. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 13 of 16
104. (stack e m)
   deleted: (holding e) (clear m)
   added: (clear e) (handempty) (on e m)
   goals met: 14 of 16
105. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 14 of 16
106. (stack c e)
   deleted: (holding c) (clear e)
   added: (clear c) (handempty) (on c e)
   goals met: 15 of 16
107. (unstack q n)
   deleted: (clear q) (handempty) (on q n)
   added: (holding q) (clear n)
   goals met: 14 of 16
108. (put-down q)
   deleted: (holding q)
   added: (clear q) (handempty) (ontable q)
   goals met: 14 of 16
109. (unstack n l)
   deleted: (clear n) (handempty) (on n l)
   added: (holding n) (clear l)
   goals met: 13 of 16
110. (put-down n)
   deleted: (holding n)
   added: (clear n) (handempty) (ontable n)
   goals met: 13 of 16
111. (pick-up q)
   deleted: (ontable q) (clear q) (handempty)
   added: (holding q)
   goals met: 13 of 16
112. (stack q n)
   deleted: (holding q) (clear n)
   added: (clear q) (handempty) (on q n)
   goals met: 14 of 16
113. (unstack l o)
   deleted: (clear l) (handempty) (on l o)
   added: (holding l) (clear o)
   goals met: 13 of 16
114. (put-down l)
   deleted: (holding l)
   added: (clear l) (handempty) (ontable l)
   goals met: 13 of 16
115. (unstack o j)
   deleted: (clear o) (handempty) (on o j)
   added: (holding o) (clear j)
   goals met: 12 of 16
116. (put-down o)
   deleted: (holding o)
   added: (clear o) (handempty) (ontable o)
   goals met: 12 of 16
117. (pick-up l)
   deleted: (ontable l) (clear l) (handempty)
   added: (holding l)
   goals met: 12 of 16
118. (stack l o)
   deleted: (holding l) (clear o)
   added: (clear l) (handempty) (on l o)
   goals met: 13 of 16
119. (unstack q n)
   deleted: (clear q) (handempty) (on q n)
   added: (holding q) (clear n)
   goals met: 12 of 16
120. (put-down q)
   deleted: (holding q)
   added: (clear q) (handempty) (ontable q)
   goals met: 12 of 16
121. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 12 of 16
122. (stack n l)
   deleted: (holding n) (clear l)
   added: (clear n) (handempty) (on n l)
   goals met: 13 of 16
123. (pick-up q)
   deleted: (ontable q) (clear q) (handempty)
   added: (holding q)
   goals met: 13 of 16
124. (stack q n)
   deleted: (holding q) (clear n)
   added: (clear q) (handempty) (on q n)
   goals met: 14 of 16
125. (unstack j h)
   deleted: (clear j) (handempty) (on j h)
   added: (holding j) (clear h)
   goals met: 13 of 16
126. (put-down j)
   deleted: (holding j)
   added: (clear j) (handempty) (ontable j)
   goals met: 13 of 16
127. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 13 of 16
128. (stack h c)
   deleted: (holding h) (clear c)
   added: (clear h) (handempty) (on h c)
   goals met: 14 of 16
129. (pick-up j)
   deleted: (ontable j) (clear j) (handempty)
   added: (holding j)
   goals met: 14 of 16
130. (stack j h)
   deleted: (holding j) (clear h)
   added: (clear j) (handempty) (on j h)
   goals met: 15 of 16
131. (unstack q n)
   deleted: (clear q) (handempty) (on q n)
   added: (holding q) (clear n)
   goals met: 14 of 16
132. (put-down q)
   deleted: (holding q)
   added: (clear q) (handempty) (ontable q)
   goals met: 14 of 16
133. (unstack n l)
   deleted: (clear n) (handempty) (on n l)
   added: (holding n) (clear l)
   goals met: 13 of 16
134. (put-down n)
   deleted: (holding n)
   added: (clear n) (handempty) (ontable n)
   goals met: 13 of 16
135. (pick-up q)
   deleted: (ontable q) (clear q) (handempty)
   added: (holding q)
   goals met: 13 of 16
136. (stack q n)
   deleted: (holding q) (clear n)
   added: (clear q) (handempty) (on q n)
   goals met: 14 of 16
137. (unstack l o)
   deleted: (clear l) (handempty) (on l o)
   added: (holding l) (clear o)
   goals met: 13 of 16
138. (put-down l)
   deleted: (holding l)
   added: (clear l) (handempty) (ontable l)
   goals met: 13 of 16
139. (pick-up o)
   deleted: (ontable o) (clear o) (handempty)
   added: (holding o)
   goals met: 13 of 16
140. (stack o j)
   deleted: (holding o) (clear j)
   added: (clear o) (handempty) (on o j)
   goals met: 14 of 16
141. (pick-up l)
   deleted: (ontable l) (clear l) (handempty)
   added: (holding l)
   goals met: 14 of 16
142. (stack l o)
   deleted: (holding l) (clear o)
   added: (clear l) (handempty) (on l o)
   goals met: 15 of 16
143. (unstack q n)
   deleted: (clear q) (handempty) (on q n)
   added: (holding q) (clear n)
   goals met: 14 of 16
144. (put-down q)
   deleted: (holding q)
   added: (clear q) (handempty) (ontable q)
   goals met: 14 of 16
145. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 14 of 16
146. (stack n l)
   deleted: (holding n) (clear l)
   added: (clear n) (handempty) (on n l)
   goals met: 15 of 16
147. (pick-up q)
   deleted: (ontable q) (clear q) (handempty)
   added: (holding q)
   goals met: 15 of 16
148. (stack q n)
   deleted: (holding q) (clear n)
   added: (clear q) (handempty) (on q n)
   goals met: 16 of 16
